$$ R_{t,t+1} = \frac{P_{t+1}-P_{t}}{P_{t}} $$

or alternatively

$$ R_{t, t+1} = \frac{P_{t+1}}{P_{t}} - 1 $$

In [2]:
prices_a = [8.70, 8.91, 8.71]

In [3]:
8.91/8.70 -1

0.024137931034482918

In [4]:
8.71/8.91 - 1

-0.022446689113355678

In [8]:
prices_a[1:] #means everything except the first one

[8.91, 8.71]

In [7]:
prices_a[:-1] #means everything except the last one

[8.7, 8.91]

In [10]:
prices_a[1:]/prices_a[:-1] - 1 # list in python is not vector. So this way of division doesn't work

TypeError: unsupported operand type(s) for /: 'list' and 'list'

### Method One

In [11]:
import numpy as np

In [13]:
prices_a = np.array([8.70, 8.91, 8.71])
prices_a

array([8.7 , 8.91, 8.71])

In [14]:
prices_a[1:]/prices_a[:-1] - 1

array([ 0.02413793, -0.02244669])

### Method Two

In [15]:
import pandas as pd

In [16]:
prices = pd.DataFrame({"BLUE": [8.70, 8.91, 8.71, 8.43, 8.73],
                      "ORANGE": [10.66, 11.08, 10.71, 11.59, 12.11],
                      })

In [17]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [18]:
prices.iloc[1:]

   BLUE  ORANGE
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [20]:
prices.iloc[:-1]

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59

In [22]:
prices.iloc[1:]/prices.iloc[:-1] #the answer is bizzare!

   BLUE  ORANGE
0   NaN     NaN
1   1.0     1.0
2   1.0     1.0
3   1.0     1.0
4   NaN     NaN

### Method Three

In [23]:
prices.iloc[1:].values/prices.iloc[:-1] -1

       BLUE    ORANGE
0  0.024138  0.039400
1 -0.022447 -0.033394
2 -0.032147  0.082166
3  0.035587  0.044866

### Method Four (similar to three)

In [24]:
prices.iloc[1:]/prices.iloc[:-1].values - 1 #as long as one is index free it will be alignment free. both results are same

       BLUE    ORANGE
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [25]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [26]:
prices.shift(1)

   BLUE  ORANGE
0   NaN     NaN
1  8.70   10.66
2  8.91   11.08
3  8.71   10.71
4  8.43   11.59

### Method Five

In [28]:
prices/prices.shift(1) -1

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

### Method Six

In [29]:
prices.pct_change()

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866